src/main/resources/xml/accommodationBatchServicePort/stageModifyData/stageModifyData.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bat="http://batch.accommodation.transferobject.booking.dreams.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <bat:stageModifyData>
         <request>
            <!--Optional:-->
            <processName>?</processName>
            <!--Zero or more repetitions:-->
            <massModifyRoomDetail>
               <!--Optional:-->
               <guaranteedBy>?</guaranteedBy>
               <!--Optional:-->
               <rsrIndicator>?</rsrIndicator>
               <!--Optional:-->
               <tcId>?</tcId>
               <!--Optional:-->
               <tpsId>?</tpsId>
               <!--Optional:-->
               <tcgId>?</tcgId>
               <!--Optional:-->
               <groupCode>?</groupCode>
               <!--Optional:-->
               <period>
                  <!--Optional:-->
                  <endDate>?</endDate>
                  <!--Optional:-->
                  <startDate>?</startDate>
               </period>
               <!--Optional:-->
               <packageCode>?</packageCode>
               <!--Optional:-->
               <teamName>?</teamName>
               <!--Optional:-->
               <taxExemptType>?</taxExemptType>
               <!--Optional:-->
               <facilityId>?</facilityId>
               <!--Optional:-->
               <resortCode>?</resortCode>
               <!--Optional:-->
               <taxExemptId>?</taxExemptId>
               <!--Optional:-->
               <roomType>?</roomType>
               <!--Optional:-->
               <blockCode>?</blockCode>
               <!--Optional:-->
               <inventoryReasonCode>?</inventoryReasonCode>
               <!--Optional:-->
               <inventoryContactName>?</inventoryContactName>
               <!--Optional:-->
               <primaryGuestDetail>
                  <!--Optional:-->
                  <suffix>?</suffix>
                  <!--Optional:-->
                  <title>?</title>
                  <!--Optional:-->
                  <firstName>?</firstName>
                  <!--Optional:-->
                  <lastName>?</lastName>
                  <!--Optional:-->
                  <middleName>?</middleName>
                  <partyId>?</partyId>
                  <!--Zero or more repetitions:-->
                  <phoneDetails>
                     <locatorId>?</locatorId>
                     <guestLocatorId>?</guestLocatorId>
                     <!--Optional:-->
                     <locatorUseType>?</locatorUseType>
                     <primary>?</primary>
                     <!--Optional:-->
                     <deviceType>?</deviceType>
                     <extension>?</extension>
                     <!--Optional:-->
                     <number>?</number>
                  </phoneDetails>
                  <!--Zero or more repetitions:-->
                  <addressDetails>
                     <locatorId>?</locatorId>
                     <guestLocatorId>?</guestLocatorId>
                     <!--Optional:-->
                     <locatorUseType>?</locatorUseType>
                     <primary>?</primary>
                     <!--Optional:-->
                     <addressLine1>?</addressLine1>
                     <!--Optional:-->
                     <addressLine2>?</addressLine2>
                     <!--Optional:-->
                     <city>?</city>
                     <!--Optional:-->
                     <country>?</country>
                     <!--Optional:-->
                     <postalCode>?</postalCode>
                     <!--Optional:-->
                     <state>?</state>
                     <!--Optional:-->
                     <regionName>?</regionName>
                  </addressDetails>
                  <!--Zero or more repetitions:-->
                  <emailDetails>
                     <locatorId>?</locatorId>
                     <guestLocatorId>?</guestLocatorId>
                     <!--Optional:-->
                     <locatorUseType>?</locatorUseType>
                     <primary>?</primary>
                     <!--Optional:-->
                     <address>?</address>
                  </emailDetails>
                  <!--Optional:-->
                  <membershipDetail>
                     <!--Optional:-->
                     <expirationDate>?</expirationDate>
                     <!--Optional:-->
                     <memberShipType>?</memberShipType>
                     <!--Optional:-->
                     <membershipId>?</membershipId>
                     <policyId>?</policyId>
                     <productChannelId>?</productChannelId>
                     <!--Optional:-->
                     <guestMembershipId>?</guestMembershipId>
                  </membershipDetail>
                  <doNotMailIndicator>?</doNotMailIndicator>
                  <doNotPhoneIndicator>?</doNotPhoneIndicator>
                  <!--Optional:-->
                  <preferredLanguage>?</preferredLanguage>
                  <dclGuestId>?</dclGuestId>
                  <!--Optional:-->
                  <dclTransferCode>?</dclTransferCode>
                  <guestId>?</guestId>
                  <!--Optional:-->
                  <guestTypeName>?</guestTypeName>
                  <!--Optional:-->
                  <favouriteCharacter>?</favouriteCharacter>
                  <active>?</active>
                  <!--Zero or more repetitions:-->
                  <guestIdReferences>
                     <type>?</type>
                     <value>?</value>
                  </guestIdReferences>
                  <!--Optional:-->
                  <gender>?</gender>
                  <!--Optional:-->
                  <dob>?</dob>
               </primaryGuestDetail>
               <!--Zero or more repetitions:-->
               <massModifyBillCodeDetailList>
                  <!--Optional:-->
                  <code>?</code>
                  <!--Optional:-->
                  <period>
                     <!--Optional:-->
                     <endDate>?</endDate>
                     <!--Optional:-->
                     <startDate>?</startDate>
                  </period>
               </massModifyBillCodeDetailList>
               <!--Optional:-->
               <confirmationIndicator>?</confirmationIndicator>
               <!--Optional:-->
               <massmodifysettlementmethoddetail>
                  <!--Optional:-->
                  <businessArea>?</businessArea>
                  <!--Optional:-->
                  <requestor>?</requestor>
                  <!--Optional:-->
                  <companyCode>?</companyCode>
                  <!--Optional:-->
                  <requestorPhone>?</requestorPhone>
                  <!--Optional:-->
                  <costCenter>?</costCenter>
                  <!--Optional:-->
                  <approver>?</approver>
                  <!--Optional:-->
                  <materialCode>?</materialCode>
                  <!--Optional:-->
                  <approverTitle>?</approverTitle>
                  <!--Optional:-->
                  <wbs>?</wbs>
                  <!--Optional:-->
                  <purposeOfVisit>?</purposeOfVisit>
                  <!--Optional:-->
                  <departmentName>?</departmentName>
                  <!--Optional:-->
                  <glAcctNo>?</glAcctNo>
               </massmodifysettlementmethoddetail>
               <!--Optional:-->
               <ticketdetail>
                  <adultTicket>?</adultTicket>
                  <hardTicketedEvent>?</hardTicketedEvent>
                  <!--Optional:-->
                  <auditDetail>
                     <!--Optional:-->
                     <createdBy>?</createdBy>
                     <!--Optional:-->
                     <createdDate>?</createdDate>
                     <!--Optional:-->
                     <updatedBy>?</updatedBy>
                     <!--Optional:-->
                     <updatedDate>?</updatedDate>
                     <!--Optional:-->
                     <status>?</status>
                  </auditDetail>
                  <baseAdmissionProductId>?</baseAdmissionProductId>
                  <!--Optional:-->
                  <code>?</code>
                  <componentId>?</componentId>
                  <dayCount>?</dayCount>
                  <!--Zero or more repetitions:-->
                  <externalReferences>
                     <!--Optional:-->
                     <externalReferenceType>?</externalReferenceType>
                     <!--Optional:-->
                     <externalReferenceCode>?</externalReferenceCode>
                     <!--Optional:-->
                     <externalReferenceNumber>?</externalReferenceNumber>
                     <!--Optional:-->
                     <externalReferenceSource>?</externalReferenceSource>
                  </externalReferences>
                  <!--Zero or more repetitions:-->
                  <featureDetails>
                     <featureId>?</featureId>
                     <!--Optional:-->
                     <featureName>?</featureName>
                  </featureDetails>
                  <!--Optional:-->
                  <guestReference>
                     <age>?</age>
                     <!--Optional:-->
                     <ageType>?</ageType>
                     <!--Optional:-->
                     <guest>
                        <!--Optional:-->
                        <suffix>?</suffix>
                        <!--Optional:-->
                        <title>?</title>
                        <!--Optional:-->
                        <firstName>?</firstName>
                        <!--Optional:-->
                        <lastName>?</lastName>
                        <!--Optional:-->
                        <middleName>?</middleName>
                        <partyId>?</partyId>
                        <!--Zero or more repetitions:-->
                        <phoneDetails>
                           <locatorId>?</locatorId>
                           <guestLocatorId>?</guestLocatorId>
                           <!--Optional:-->
                           <locatorUseType>?</locatorUseType>
                           <primary>?</primary>
                           <!--Optional:-->
                           <deviceType>?</deviceType>
                           <extension>?</extension>
                           <!--Optional:-->
                           <number>?</number>
                        </phoneDetails>
                        <!--Zero or more repetitions:-->
                        <addressDetails>
                           <locatorId>?</locatorId>
                           <guestLocatorId>?</guestLocatorId>
                           <!--Optional:-->
                           <locatorUseType>?</locatorUseType>
                           <primary>?</primary>
                           <!--Optional:-->
                           <addressLine1>?</addressLine1>
                           <!--Optional:-->
                           <addressLine2>?</addressLine2>
                           <!--Optional:-->
                           <city>?</city>
                           <!--Optional:-->
                           <country>?</country>
                           <!--Optional:-->
                           <postalCode>?</postalCode>
                           <!--Optional:-->
                           <state>?</state>
                           <!--Optional:-->
                           <regionName>?</regionName>
                        </addressDetails>
                        <!--Zero or more repetitions:-->
                        <emailDetails>
                           <locatorId>?</locatorId>
                           <guestLocatorId>?</guestLocatorId>
                           <!--Optional:-->
                           <locatorUseType>?</locatorUseType>
                           <primary>?</primary>
                           <!--Optional:-->
                           <address>?</address>
                        </emailDetails>
                        <!--Optional:-->
                        <membershipDetail>
                           <!--Optional:-->
                           <expirationDate>?</expirationDate>
                           <!--Optional:-->
                           <memberShipType>?</memberShipType>
                           <!--Optional:-->
                           <membershipId>?</membershipId>
                           <policyId>?</policyId>
                           <productChannelId>?</productChannelId>
                           <!--Optional:-->
                           <guestMembershipId>?</guestMembershipId>
                        </membershipDetail>
                        <doNotMailIndicator>?</doNotMailIndicator>
                        <doNotPhoneIndicator>?</doNotPhoneIndicator>
                        <!--Optional:-->
                        <preferredLanguage>?</preferredLanguage>
                        <dclGuestId>?</dclGuestId>
                        <!--Optional:-->
                        <dclTransferCode>?</dclTransferCode>
                        <guestId>?</guestId>
                        <!--Optional:-->
                        <guestTypeName>?</guestTypeName>
                        <!--Optional:-->
                        <favouriteCharacter>?</favouriteCharacter>
                        <active>?</active>
                        <!--Zero or more repetitions:-->
                        <guestIdReferences>
                           <type>?</type>
                           <value>?</value>
                        </guestIdReferences>
                        <!--Optional:-->
                        <gender>?</gender>
                        <!--Optional:-->
                        <dob>?</dob>
                     </guest>
                     <!--Optional:-->
                     <purposeOfVisit>?</purposeOfVisit>
                     <!--Optional:-->
                     <role>?</role>
                     <correlationID>?</correlationID>
                     <!--Zero or more repetitions:-->
                     <experienceMediaDetails>
                        <id>?</id>
                        <mediaCustomization>
                           <optOut>?</optOut>
                           <!--Optional:-->
                           <optOutReason>?</optOutReason>
                           <!--Optional:-->
                           <color>?</color>
                           <!--Optional:-->
                           <printedName>?</printedName>
                           <!--Optional:-->
                           <optOutAvailable>?</optOutAvailable>
                        </mediaCustomization>
                     </experienceMediaDetails>
                  </guestReference>
                  <partOfPackage>?</partOfPackage>
                  <!--Optional:-->
                  <price>
                     <currency>?</currency>
                     <amount>?</amount>
                  </price>
                  <selectable>?</selectable>
                  <!--Optional:-->
                  <status>?</status>
                  <!--Optional:-->
                  <ticketDescription>?</ticketDescription>
                  <!--Optional:-->
                  <totalAmount>
                     <currency>?</currency>
                     <amount>?</amount>
                  </totalAmount>
                  <complimentaryTicket>?</complimentaryTicket>
                  <!--Optional:-->
                  <complimentaryTicketDetail>
                     <!--Optional:-->
                     <comment>?</comment>
                     <!--Optional:-->
                     <reason>?</reason>
                     <!--Optional:-->
                     <validityPeriod>
                        <!--Optional:-->
                        <endDate>?</endDate>
                        <!--Optional:-->
                        <startDate>?</startDate>
                     </validityPeriod>
                  </complimentaryTicketDetail>
                  <!--Optional:-->
                  <ticketUsagePeriod>
                     <!--Optional:-->
                     <endDate>?</endDate>
                     <!--Optional:-->
                     <startDate>?</startDate>
                  </ticketUsagePeriod>
               </ticketdetail>
            </massModifyRoomDetail>
         </request>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </bat:stageModifyData>
   </soapenv:Body>
</soapenv:Envelope>